import pandas as pd
import matplotlib
import numpy as np
import matplotlib.pyplot as plt

station = ['后卫寨', '三桥', '皂河', '枣园', '汉城路', '开远门', '劳动路', '玉祥门', '洒金桥', '北大街1', '五路口', '朝阳门', '康复路', '通化门1', '万寿路',
           '长乐坡', '浐河', '半坡', '纺织城', '北客站', '北苑', '运动公园', '行政中心', '凤城五路', '市图书馆', '大明宫西', '龙首原', '安远门', '北大街2', '钟楼',
           '永宁门', '南稍门', '体育场', '小寨合', '纬一街', '会展中心', '三爻', '凤栖原', '航天城', '韦曲南', '鱼化寨', '丈八北路', '延平门', '科技路', '太白南路',
           '吉祥村', '大雁塔', '北池头', '青龙寺', '延兴门', '咸宁路', '长乐公园', '通化门3', '胡家庙', '石家街', '辛家庙', '广泰门', '桃花潭', '浐灞中心',
           '香湖湾', '务庄', '国际港务区', '双寨', '新筑', '保税区', '航天新城', '航天东路', '神舟大道', '东长安街', '飞天路', '航天大道', '金滹沱', '曲江池西',
           '大唐芙蓉园', '大雁塔', '西安科技大学', '建筑科技大学·李家村', '和平门', '大差市', '五路口', '火车站', '含元殿', '大明宫', '大明宫北', '余家寨', '百花村',
           '常青路', '市中医医院', '行政中心', '文景路', '凤城九路', '凤城十二路', '元朔路', '北客站(北广场)']
# times = ['225', '226', '227', '228', '301', '302', '303']
times = ['225']
for t in times:
    df = pd.read_excel("D:\\数据处理\\dealwith2\\线路分时段客运量统计报表20190%s.xlsx" % t, header=0, names=None)
    df.eval('小寨合 = 小寨2 + 小寨3', inplace=True)
    _in = df[df['inout'] == '进站']

    plt.rc('font', family='STXihei', size=10)
    for i in station:
        s = np.array(df[i])
        plt.plot(s, '-', label=i)
        plt.legend()
    plt.show()




